duxinglang-1/nRF5340_test/N2_NCS2.5.2_TEST/src/ble/ble.c
#ifdef UART_DEBUG
	LOGD("type:%d, flag:%d", buf[5], buf[6]);
#endif

	switch(buf[6])
	{
	case 0://关闭传感器
		break;
	case 1://打开传感器
		break;
	}

	if(buf[6] == 0)
	{
		//packet head
		reply[reply_len++] = PACKET_HEAD;
		//data_len
		reply[reply_len++] = 0x00;
		reply[reply_len++] = 0x07;
		//data ID
		reply[reply_len++] = (HEART_RATE_ID>>8);		
		reply[reply_len++] = (uint8_t)(HEART_RATE_ID&0x00ff);
		//status
		reply[reply_len++] = buf[5];
		//control
		reply[reply_len++] = buf[6];
		//heart rate
		reply[reply_len++] = 0;
		//CRC
		reply[reply_len++] = 0x00;
		//packet end
		reply[reply_len++] = PACKET_END;

		for(i=0;i<(reply_len-2);i++)
			reply[reply_len-2] += reply[i];

		//BleSendData(reply, reply_len);	
	}
	else
	{
		health_record_t last_data = {0};

		switch(buf[5])
		{
		case 0x01://实时测量心率
			StartPPG(PPG_DATA_HR, TRIGGER_BY_APP);
			break;

		case 0x02://单次测量心率
			get_cur_health_from_record(&last_data);
			MCU_send_app_get_ppg_data(PPG_DATA_HR, &last_data.hr_rec.hr);
			break;
		}
	}
}

void APP_get_spo2(uint8_t *buf, uint32_t len)
{
	uint8_t heart_rate,reply[128] = {0};
	uint32_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("type:%d, flag:%d", buf[5], buf[6]);
#endif

	switch(buf[6])
	{
	case 0://关闭传感器
		break;
	case 1://打开传感器
		break;
	}

	if(buf[6] == 0)
	{
		//packet head
		reply[reply_len++] = PACKET_HEAD;
		//data_len
		reply[reply_len++] = 0x00;
		reply[reply_len++] = 0x07;
		//data ID
		reply[reply_len++] = (BLOOD_OXYGEN_ID>>8);		
		reply[reply_len++] = (uint8_t)(BLOOD_OXYGEN_ID&0x00ff);
		//status
		reply[reply_len++] = buf[5];
		//control
		reply[reply_len++] = buf[6];
		//heart rate
		reply[reply_len++] = 0;
		//CRC
		reply[reply_len++] = 0x00;
		//packet end
		reply[reply_len++] = PACKET_END;

		for(i=0;i<(reply_len-2);i++)
			reply[reply_len-2] += reply[i];

		//BleSendData(reply, reply_len);	
	}
	else
	{
		health_record_t last_data = {0};

		switch(buf[5])
		{
		case 0x01://实时测量血氧
			StartPPG(PPG_DATA_SPO2, TRIGGER_BY_APP);
			break;

		case 0x02://单次测量血氧
			get_cur_health_from_record(&last_data);
			MCU_send_app_get_ppg_data(PPG_DATA_SPO2, &last_data.spo2_rec.spo2);
			break;
		}
	}
}

void APP_get_bpt(uint8_t *buf, uint32_t len)
{
	uint8_t heart_rate,reply[128] = {0};
	uint32_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("type:%d, flag:%d", buf[5], buf[6]);
#endif

	switch(buf[6])
	{
	case 0://关闭传感器
		break;
	case 1://打开传感器
		break;
	}

	if(buf[6] == 0)
	{
		//packet head
		reply[reply_len++] = PACKET_HEAD;
		//data_len
		reply[reply_len++] = 0x00;
		reply[reply_len++] = 0x07;
		//data ID
		reply[reply_len++] = (BLOOD_PRESSURE_ID>>8);		
		reply[reply_len++] = (uint8_t)(BLOOD_PRESSURE_ID&0x00ff);
		//status
		reply[reply_len++] = buf[5];
		//control
		reply[reply_len++] = buf[6];
		//heart rate
		reply[reply_len++] = 0;
		//CRC
		reply[reply_len++] = 0x00;
		//packet end
		reply[reply_len++] = PACKET_END;

		for(i=0;i<(reply_len-2);i++)
			reply[reply_len-2] += reply[i];

		//BleSendData(reply, reply_len);	
	}
	else
	{
		uint8_t data[2] = {0};
		health_record_t last_data = {0};

		switch(buf[5])
		{
		case 0x01://实时测量血压
			StartPPG(PPG_DATA_BPT, TRIGGER_BY_APP);
			break;

		case 0x02://单次测量血压
			get_cur_health_from_record(&last_data);
			data[0] = last_data.bpt_rec.bpt.systolic;
			data[1] = last_data.bpt_rec.bpt.diastolic;
			MCU_send_app_get_ppg_data(PPG_DATA_BPT, data);
			break;
		}
	}
}
#endif

#ifdef CONFIG_TEMP_SUPPORT
void APP_get_temp(uint8_t *buf, uint32_t len)
{
	uint8_t heart_rate,reply[128] = {0};
	uint32_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("type:%d, flag:%d", buf[5], buf[6]);
#endif

	switch(buf[6])
	{
	case 0://关闭传感器
		break;
	case 1://打开传感器
		break;
	}

	if(buf[6] == 0)
	{
		//packet head
		reply[reply_len++] = PACKET_HEAD;
		//data_len
		reply[reply_len++] = 0x00;
		reply[reply_len++] = 0x07;
		//data ID
		reply[reply_len++] = (TEMPERATURE_ID>>8);		
		reply[reply_len++] = (uint8_t)(TEMPERATURE_ID&0x00ff);
		//status
		reply[reply_len++] = buf[5];
		//control
		reply[reply_len++] = buf[6];
		//heart rate
		reply[reply_len++] = 0;
		//CRC
		reply[reply_len++] = 0x00;
		//packet end
		reply[reply_len++] = PACKET_END;

		for(i=0;i<(reply_len-2);i++)
			reply[reply_len-2] += reply[i];

		//BleSendData(reply, reply_len);	
	}
	else
	{
		uint8_t data[2] = {0};
		health_record_t last_data = {0};

		switch(buf[5])
		{
		case 0x01://实时测量体温
			APPStartTemp();
			break;

		case 0x02://单次测量体温
			get_cur_health_from_record(&last_data);
			data[0] = last_data.temp_rec.deca_temp>>8;
			data[1] = (uint8_t)(last_data.temp_rec.deca_temp&0x00ff);
			MCU_send_app_get_temp_data(data);
			break;
		}
	}
}
#endif

void MCU_get_ble_status(void)
{
	uint8_t reply[128] = {0};
	uint32_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x06;
	//data ID
	reply[reply_len++] = (GET_BLE_STATUS_ID>>8);		
	reply[reply_len++] = (uint8_t)(GET_BLE_STATUS_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	//BleSendData(reply, reply_len);
}

//手环查找手机
void MCU_send_find_phone(void)
{
	uint8_t reply[128] = {0};
	uint32_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x07;
	//data ID
	reply[reply_len++] = (FIND_PHONE_ID>>8);		
	reply[reply_len++] = (uint8_t)(FIND_PHONE_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//data
	reply[reply_len++] = 0x01;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	//BleSendData(reply, reply_len);	
}

//手环上报一键测量数据
void MCU_send_app_one_key_measure_data(void)
{
	uint8_t heart_rate,spo2,systolic,diastolic;
	uint8_t reply[128] = {0};
	uint32_t i,reply_len = 0;

