duxinglang-1/nRF5340_test/N2_NCS2.5.2_TEST/src/ble/ble.c
#ifdef UART_DEBUG
	LOGD("begin");
#endif

	GetPPGData(&heart_rate, &spo2, &systolic, &diastolic);
	
	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x0A;
	//data ID
	reply[reply_len++] = (ONE_KEY_MEASURE_ID>>8);		
	reply[reply_len++] = (uint8_t)(ONE_KEY_MEASURE_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x01;
	//data hr
	reply[reply_len++] = heart_rate;
	//data spo2
	reply[reply_len++] = spo2;
	//data systolic
	reply[reply_len++] = systolic;
	//data diastolic
	reply[reply_len++] = diastolic;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	//BleSendData(reply, reply_len);
}

void MCU_send_app_get_ppg_data(PPG_DATA_TYPE flag, uint8_t *data)
{
	uint8_t reply[128] = {0};
	uint32_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x07;
	//data ID
	switch(flag)
	{
	case PPG_DATA_HR:
		reply[reply_len++] = (HEART_RATE_ID>>8);		
		reply[reply_len++] = (uint8_t)(HEART_RATE_ID&0x00ff);
		break;
	case PPG_DATA_SPO2:
		reply[reply_len++] = (BLOOD_OXYGEN_ID>>8);		
		reply[reply_len++] = (uint8_t)(BLOOD_OXYGEN_ID&0x00ff);
		break;
	case PPG_DATA_BPT:
		reply[reply_len++] = (BLOOD_PRESSURE_ID>>8);		
		reply[reply_len++] = (uint8_t)(BLOOD_PRESSURE_ID&0x00ff);
		break;
	}
	//status
	reply[reply_len++] = 0x02;
	//control
	reply[reply_len++] = 0x01;
	switch(flag)
	{
	case PPG_DATA_HR:
		reply[reply_len++] = data[0];
		break;
	case PPG_DATA_SPO2:
		reply[reply_len++] = data[0];
		break;
	case PPG_DATA_BPT:
		reply[reply_len++] = data[0];		
		reply[reply_len++] = data[1];
		break;
	}
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	//BleSendData(reply, reply_len);
}

void MCU_send_app_get_temp_data(uint8_t *data)
{
	uint8_t reply[128] = {0};
	uint32_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x07;
	//data ID
	reply[reply_len++] = (TEMPERATURE_ID>>8);		
	reply[reply_len++] = (uint8_t)(TEMPERATURE_ID&0x00ff);
	//status
	reply[reply_len++] = 0x02;
	//control
	reply[reply_len++] = 0x01;
	//tempdata
	reply[reply_len++] = data[0];		
	reply[reply_len++] = data[1];
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	//BleSendData(reply, reply_len);
}

void nrf52810_report_work_mode(uint8_t *buf, uint32_t len)
{
#ifdef UART_DEBUG
	LOGD("mode:%d", buf[5]);
#endif

	if(buf[5] == 1)
	{
		ble_work_mode = BLE_WORK_NORMAL;
	}
	else
	{
		ble_work_mode = BLE_WORK_DFU;
		if(g_ble_connected)
		{
			g_ble_connected = false;
		}
	}
}

void get_ble_status_response(uint8_t *buf, uint32_t len)
{
#ifdef UART_DEBUG
	LOGD("BLE_status:%d", buf[7]);
#endif

	g_ble_status = buf[7];

	switch(g_ble_status)
	{
	case BLE_STATUS_OFF:
	case BLE_STATUS_SLEEP:
	case BLE_STATUS_BROADCAST:
		g_ble_connected = false;
		break;

	case BLE_STATUS_CONNECTED:
		g_ble_connected = true;
		break;
	}
}
#endif

void get_nrf52810_ver_response(uint8_t *buf, uint32_t len)
{
	uint32_t i;

	for(i=0;i<len-9;i++)
	{
		g_nrf52810_ver[i] = buf[7+i];
	}

#ifdef UART_DEBUG
	LOGD("nrf52810_ver:%s", g_nrf52810_ver);
#endif
}

void get_ble_mac_address_response(uint8_t *buf, uint32_t len)
{
	uint32_t i;
	uint8_t mac_addr[6] = {0};
	
	for(i=0;i<6;i++)
		mac_addr[i] = buf[7+i];

	sprintf(g_ble_mac_addr, "%02X:%02X:%02X:%02X:%02X:%02X", 
							mac_addr[0],
							mac_addr[1],
							mac_addr[2],
							mac_addr[3],
							mac_addr[4],
							mac_addr[5]);
#ifdef UART_DEBUG
	LOGD("ble_mac_addr:%s", g_ble_mac_addr);
#endif
}

void MCU_get_nrf52810_ver(void)
{
	uint8_t reply[128] = {0};
	uint32_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x06;
	//data ID
	reply[reply_len++] = (GET_BLE_VER_ID>>8);		
	reply[reply_len++] = (uint8_t)(GET_BLE_VER_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	//BleSendData(reply, reply_len);
}

void MCU_get_ble_mac_address(void)
{
	uint8_t reply[128] = {0};
	uint32_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x06;
	//data ID
	reply[reply_len++] = (GET_BLE_MAC_ADDR_ID>>8);		
	reply[reply_len++] = (uint8_t)(GET_BLE_MAC_ADDR_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	//BleSendData(reply, reply_len);
}

//设置BLE工作模式		0:关闭 1:打开 2:唤醒 3:休眠
void MCU_set_ble_work_mode(ENUM_BLE_MODE work_mode)
{
	uint8_t reply[128] = {0};
	uint32_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x06;
	//data ID
	reply[reply_len++] = (SET_BEL_WORK_MODE_ID>>8);		
	reply[reply_len++] = (uint8_t)(SET_BEL_WORK_MODE_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = work_mode;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	//BleSendData(reply, reply_len);	
}

void BLEMsgProcess(void)
{
}

void BLE_init(void)
{
}


